Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum
The value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_AXIAL
The axial (FX) (N) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Y
The shear Y (FY) (N) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Z
The shear Z (FZ) (N) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_TORSION_MOMENT
The torsion moment (MX) (Nm) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_MOMENT_Y
The bending moment Y (MY) (Nm) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_MOMENT_Z
The bending moment Z (MZ) (Nm) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_YZ
The shear resultant (positive) (N) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_MOMENT_YZ
The moment resultant (positive) (Nm) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_ECC_MOMENT_Y
The eccentricity moment Y (Nm) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_ECC_MOMENT_Z
The eccentricity moment Z (Nm) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_STEEL_UTILITY_RATIO
The utility ratio value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_GLOBAL_REACTION_X
The reaction in global X (N) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_GLOBAL_REACTION_Y
The reaction in global Y (N) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_GLOBAL_REACTION_Z
The reaction in global Z (N) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_DISPLACEMENT_X
The displacement in global X (mm) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_DISPLACEMENT_Y
The displacement in global Y (mm) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_DISPLACEMENT_Z
The displacement in global Z (mm) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_ROTATION_X
The rotation around global X (rad) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_ROTATION_Y
The rotation around global Y (rad) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_ROTATION_Z
The rotation around global Z (rad) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_REINFORCEMENT_AREA
The reinforcement area (total) (mm2) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_REINFORCEMENT_BOTTOM
The bottom reinforcement area (mm2) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_REINFORCEMENT_TOP
The top reinforcement area (mm2) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_REINFORCEMENT_SHEAR
The shear reinforcement area (mm2/m) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_MAIN_DIRECTION_X
The slab main direction cosine, X component, value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_MAIN_DIRECTION_Y
The slab main direction cosine, Y component, value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_MAIN_DIRECTION_Z
The slab main direction cosine, Z component, value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_SECONDARY_DIRECTION_X
The slab secondary direction cosine, X component, value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_SECONDARY_MAIN_DIRECTION_Y
The slab secondary direction cosine, Y component, value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_SECONDARY_MAIN_DIRECTION_Z
The slab secondary direction cosine, Z component, value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_MAIN_REINFORCEMENT_BOTTOM
The slab main reinforcement, bottom (mm2/m), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_MAIN_REINFORCEMENT_TOP
The slab main reinforcement, top (mm2/m), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_SEC_REINFORCEMENT_BOTTOM
The slab secondary reinforcement, bottom (mm2/m), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_SEC_REINFORCEMENT_TOP
The slab secondary reinforcement, top (mm2/m), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SLAB_SHEAR_REINFORCEMENT
The slab shear reinforcement (mm2/m) value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_AXIAL_MINUS
Use POSITION_BY_COORDINATES_MINUS to enter minus side value.
The axial (FX), minus side (N), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Y_MINUS
Use POSITION_BY_COORDINATES_MINUS to enter minus side value.
The shear Y (FY), minus side (N), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Z_MINUS
Use POSITION_BY_COORDINATES_MINUS to enter minus side value.
The shear Z (FZ), minus side (N), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_TORSION_MOMENT_MINUS
Use POSITION_BY_COORDINATES_MINUS to enter minus side value.
The torsion moment (MX), minus side (Nm), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_MOMENT_Y_MINUS
Use POSITION_BY_COORDINATES_MINUS to enter minus side value.
The bending moment Y (MY), minus side (Nm), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_MOMENT_Z_MINUS
Use POSITION_BY_COORDINATES_MINUS to enter minus side value.
The bending moment Z (MZ), minus side (Nm), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_AXIAL_PLUS
Use POSITION_BY_COORDINATES_MINUS to enter plus side value.
The axial (FX), plus side (N), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Y_PLUS
Use POSITION_BY_COORDINATES_MINUS to enter plus side value.
The shear Y (FY), plus side (N), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_SHEAR_Z_PLUS
Use POSITION_BY_COORDINATES_MINUS to enter plus side value.
The shear Z (FZ), plus side (N), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_TORSION_MOMENT_PLUS
Use POSITION_BY_COORDINATES_MINUS to enter plus side value.
The torsion moment (MX), plus side (Nm), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_MOMENT_Y_PLUS
Use POSITION_BY_COORDINATES_MINUS to enter plus side value.
The bending moment Y (MY), plus side (Nm), value type.

Tekla.Structures.Analysis.AnalysisResult.ValueTypeEnum.VALUETYPE_MOMENT_Z_PLUS
Use POSITION_BY_COORDINATES_MINUS to enter plus side value.
The bending moment Z (MZ), plus side (Nm), value type.